---
type: TextElement
namespace: Autodesk.Revit.DB
version: 2024
members: 16
tags: [revit-api, class]
---

# TextElement

`Autodesk.Revit.DB.TextElement` · Revit 2024 · 16 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetMaximumAllowedWidth | — | `` |
| Method | GetMaximumAllowedWidth | 2016 | `public double GetMaximumAllowedWidth ()` |
| Method | GetMinimumAllowedWidth | — | `` |
| Method | GetMinimumAllowedWidth | 2016 | `public double GetMinimumAllowedWidth ()` |
| Property | BaseDirection | — | `public XYZ BaseDirection { get ; }` |
| Property | Coord | — | `public XYZ Coord { get ; set ; }` |
| Property | Height | — | `public double Height { get ; }` |
| Property | HorizontalAlignment | 2016 | `public HorizontalTextAlignment HorizontalAlignment { get ; set ; }` |
| Property | IsTextWrappingActive | 2016 | `public bool IsTextWrappingActive { get ; }` |
| Property | KeepRotatedTextReadable | 2016 | `public bool KeepRotatedTextReadable { get ; set ; }` |
| Property | Parameter | — | `` |
| Property | Symbol | — | `public TextElementType Symbol { get ; }` |
| Property | Text | — | `public string Text { get ; set ; }` |
| Property | UpDirection | — | `public XYZ UpDirection { get ; }` |
| Property | VerticalAlignment | 2016 | `public VerticalTextAlignment VerticalAlignment { get ; set ; }` |
| Property | Width | 2016 | `public double Width { get ; set ; }` |